# Напишите функцию, которая переводит целое число от 1 до 99 в текст.Например, 1 — "один", 15 — "пятнадцать", 42 — "сорок два". Программа должна запрашивать у пользователя ввод числа и выводить его текстовое представление.

def number_text_translator(number):
    ones = {
        1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть", 7: "семь", 8: "восемь", 9: "девять"
    }

    teens = {
        10: "десять", 11: "одиннадцать", 12: "двенадцать", 13: "тринадцать", 14: "четырнадцать", 15: "пятнадцать",
        16: "шестнадцать", 17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать"
    }

    tens = {
        20: "двадцать", 30: "тридцать", 40: "сорок", 50: "пятьдесят", 60: "шестьдесят", 70: "семьдесят",
        80: "восемьдесят", 90: "девяносто"
    }

    if number in ones:
        return ones[number]
    elif number in teens:
        return teens[number]
    elif number in tens:
        return tens[number]
    else:
        ten = (number // 10) * 10
        one = number % 10
        return f"{tens[ten]} {ones[one]}" if one != 0 else tens[ten]

while True:
    try:
        number = int(input("Введите целое число от 1 до 99 (или 0 для выхода): "))

        if number == 0:
            break

        if 1 <= number <= 99:
            print(number_text_translator(number))
        else:
            print("Ошибка: введите число от 1 до 99")

    except ValueError:
        print("Ошибка: Введите целое число")